
{
    "Fase 1 - Sobrevivência": {
        "pessoa_fisica": "<h2>Objetivo: Aliviar a Pressão Financeira</h2><p>Com um Índice de Compressão Financeira (ICF) de <strong>${icf}</strong>, suas despesas fixas estão consumindo a maior parte da sua renda. É uma fase crítica. <strong>Ação Imediata:</strong> Revise todos os seus custos e reduza despesas não essenciais de forma decisiva. A meta é diminuir o ICF para menos de 0.95 e recuperar seu fôlego financeiro.</p>",
        "autonomo": "<h2>Objetivo: Garantir a Continuidade</h2><p>Seu ICF de <strong>${icf}</strong> indica um risco elevado. Custos fixos altos, combinados com a natural instabilidade da sua receita, criam um cenário vulnerável. <strong>Ação Imediata:</strong> Reduza seus custos fixos operacionais e pessoais de maneira significativa. Em paralelo, concentre-se em estabilizar ou aumentar sua carteira de clientes para fortalecer o fluxo de caixa.</p>",
        "empresa": "<h2>Objetivo: Estabilizar a Operação</h2><p>O ICF da sua empresa (<strong>${icf}</strong>) está em um nível crítico. Os custos fixos estão pressionando o faturamento, limitando sua margem de manobra. <strong>Ação Imediata:</strong> Renegocie contratos com fornecedores, otimize despesas operacionais e revise sua estratégia de precificação. O objetivo é reduzir o ICF para menos de 0.95 e assegurar a saúde operacional do negócio.</p>"
    },
    "Fase 2 - Neutralização": {
        "pessoa_fisica": "<h2>Objetivo: Construir a Reserva de Emergência</h2><p>Você neutralizou o risco imediato (ICF: <strong>${icf}</strong>), um passo importante. Agora, a prioridade é construir sua segurança. <strong>Ação Estratégica:</strong> Direcione todo valor excedente para iniciar sua reserva de emergência. O alvo é acumular o equivalente a <strong>${reserveTarget} meses</strong> de seus custos essenciais.</p>",
        "autonomo": "<h2>Objetivo: Criar um Fundo de Estabilidade</h2><p>Sua operação se sustenta (ICF: <strong>${icf}</strong>), mas é preciso proteger-se da volatilidade da receita. <strong>Ação Estratégica:</strong> Todo lucro que exceder seus custos de vida deve ser direcionado para sua reserva de segurança. Este será seu fundo de estabilidade para enfrentar meses de menor faturamento com tranquilidade.</p>",
        "empresa": "<h2>Objetivo: Formar Capital de Giro</h2><p>Sua empresa opera no ponto de equilíbrio (ICF: <strong>${icf}</strong>), mas ainda sem uma margem de segurança robusta. <strong>Ação Estratégica:</strong> A prioridade máxima é reter lucros para formar um capital de giro sólido. Essa reserva é fundamental para absorver imprevistos e preparar a empresa para o crescimento futuro.</p>"
    },
    "Fase 3 - Consolidação": {
        "pessoa_fisica": "<h2>Objetivo: Atingir a Meta de Segurança</h2><p>Sua estrutura financeira é estável (ICF: <strong>${icf}</strong>), mas sua reserva (MSD: <strong>${msd}</strong>) ainda não alcançou a meta ideal de <strong>${reserveTarget} meses</strong>. <strong>Ação Estratégica:</strong> Automatize transferências mensais para sua reserva de emergência. A disciplina e a consistência agora são essenciais para consolidar sua total segurança financeira.</p>",
        "autonomo": "<h2>Objetivo: Atingir a Meta de Segurança</h2><p>Sua base operacional é saudável (ICF: <strong>${icf}</strong>), mas sua reserva (MSD: <strong>${msd}</strong>) precisa ser fortalecida para blindá-lo contra a instabilidade do mercado. <strong>Ação Estratégica:</strong> Mantenha o foco em aumentar sua reserva até atingir a meta de <strong>${reserveTarget} meses</strong>. Evite distrações e investimentos de risco até que sua base esteja totalmente segura.</p>",
        "empresa": "<h2>Objetivo: Fortalecer o Caixa Estratégico</h2><p>Sua empresa é lucrativa e estável (ICF: <strong>${icf}</strong>), mas o caixa (MSD: <strong>${msd}</strong>) ainda não atingiu o nível ideal para operar por <strong>${reserveTarget} meses</strong> sem faturamento. <strong>Ação Estratégica:</strong> Continue a fortalecer seu capital de giro. Um caixa robusto permite tomar decisões estratégicas e proativas, em vez de apenas reagir às circunstâncias.</p>"
    },
    "Fase 4 - Expansão": {
        "pessoa_fisica": "<h2>Fase de Expansão: Investir e Crescer</h2><p>Parabéns! Com uma estrutura financeira sólida (ICF: <strong>${icf}</strong>) e reservas acima da meta (MSD: <strong>${msd}</strong>), você construiu a base ideal para crescer. Agora é o momento de usar seu excedente para investir em seus objetivos de longo prazo, como aposentadoria, educação ou grandes projetos pessoais.</p>",
        "autonomo": "<h2>Fase de Expansão: Investir e Crescer</h2><p>Excelente! Com uma reserva de segurança consolidada (MSD: <strong>${msd}</strong>), você tem a liberdade para assumir riscos calculados. Este é o momento ideal para investir em marketing, adquirir novas habilidades ou diversificar suas fontes de receita para acelerar seu crescimento.</p>",
        "empresa": "<h2>Fase de Expansão: Investir e Crescer</h2><p>Sua empresa atingiu um patamar de fortaleza financeira (ICF: <strong>${icf}</strong>, MSD: <strong>${msd}</strong>). Com uma operação estável e capital de giro robusto, é o momento de tomar decisões de crescimento, como contratar talentos, investir em inovação, explorar novos mercados ou aumentar a distribuição de lucros.</p>"
    },
    "Fase 5 - Legado": {
        "pessoa_fisica": "<h2>Fase de Legado: Perpetuar e Otimizar</h2><p>Você alcançou a maestria financeira. Seus indicadores (ICF: <strong>${icf}</strong>, MSD: <strong>${msd}</strong>) demonstram uma solidez excepcional. O foco agora se volta para a otimização tributária, o planejamento sucessório e a criação de um legado duradouro. Explore investimentos sofisticados e estratégias para perpetuar seu patrimônio.</p>",
        "autonomo": "<h2>Fase de Legado: Consolidar e Multiplicar</h2><p>Sua autonomia está no auge, com segurança financeira para décadas (MSD: <strong>${msd}</strong>). É hora de pensar além do crescimento e focar em como seu trabalho e patrimônio podem gerar impacto no longo prazo. Considere mentorias, investimentos-anjo ou a criação de novos negócios com o capital excedente.</p>",
        "empresa": "<h2>Fase de Legado: Governança e Perpetuidade</h2><p>Sua empresa é uma fortaleza (ICF: <strong>${icf}</strong>) com um caixa que garante sua perpetuidade (MSD: <strong>${msd}</strong>). A questão agora é estratégica: fortalecer a governança, preparar sucessores e explorar fusões, aquisições ou a criação de um conselho para guiar a empresa rumo ao futuro. O foco muda de operar para construir um legado empresarial.</p>"
    },
    "Erro de Dados": {
        "pessoa_fisica": "<h2>Dados Insuficientes</h2><p>Não foi possível gerar um diagnóstico. Por favor, insira suas receitas e despesas para que a análise seja realizada.</p>",
        "autonomo": "<h2>Dados Insuficientes</h2><p>Não foi possível gerar um diagnóstico. Por favor, insira suas receitas e despesas para que a análise seja realizada.</p>",
        "empresa": "<h2>Dados Insuficientes</h2><p>Não foi possível gerar um diagnóstico. Por favor, insira o faturamento e os custos da sua empresa para que a análise seja realizada.</p>"
    }
}
